       IDENTIFICATION DIVISION.
       PROGRAM-ID. BMIFILE.
       DATA DIVISION.
       ENVIRONMENT DIVISION.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BMI-FILE ASSIGN TO "BMI-INPUT.DAT".
           
       WORKING-STORAGE SECTION.
       
